// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиентеНаСервереБезКонтекста
Процедура ФормированиеJSON()

    //Запрос = Новый Запрос()

КонецПроцедуры // ФормированиеJSON()

&НаСервере
Процедура СформироватьНаСервере()
       
    Запрос = Новый Запрос;
    Запрос.Текст= "ВЫБРАТЬ
                  | ВопросыШаблонаАнкет.Транслит КАК Транслит,
                  | ВопросыШаблонаАнкет.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
                  | ВопросыШаблонаАнкет.ЭлементарныйВопрос.ТипЗначения КАК ЭлементарныйВопросТипЗначения,
                  | ВопросыШаблонаАнкет.ТабличныйВопрос КАК ТабличныйВопрос,
                  | ВопросыШаблонаАнкет.Наименование КАК Наименование,
                  | ВопросыШаблонаАнкет.Обязательный КАК Обязательный,
                  | ВопросыШаблонаАнкет.Ссылка КАК Ссылка
                  |ИЗ
                  | Справочник.ВопросыШаблонаАнкет КАК ВопросыШаблонаАнкет
                  |ГДЕ
                  | ВопросыШаблонаАнкет.Владелец = &Владелец
                  | И ВопросыШаблонаАнкет.ЭтоГруппа = ЛОЖЬ";
    Запрос.УстановитьПараметр("Владелец", Анкета);
                  
    Выборка = Запрос.Выполнить().Выбрать();
    
    МассивПолей = Новый Массив();
    
    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("title", "Тестовая Анкета");
    СтруктураПолей.Вставить("properties", Новый Структура());
    
    СтруктураСвойств = Новый Структура; 
    МассивПолей =новый Массив;
    Пока Выборка.Следующий() Цикл
        
        /////////////Обязательные поля -- начало 
        Если Выборка.Обязательный Тогда
        	МассивПолей.Добавить(Выборка.Транслит);
        КонецЕсли;
        
        Если МассивПолей.Количество() > 0 Тогда
        	СтруктураПолей.Вставить("required",МассивПолей);
        КонецЕсли;
        /////////////Обязательные поля -- конец
        
        Если Выборка.ТабличныйВопрос Тогда
        
            МассивПолей = СтруктураТабличныйВопрос(Выборка);
                        
        ИначеЕсли Выборка.ЭлементарныйВопросТипЗначения.СодержитТип(Тип("Строка")) ИЛИ Выборка.ЭлементарныйВопросТипЗначения.СодержитТип(Тип("Число")) ИЛИ Выборка.ЭлементарныйВопросТипЗначения.СодержитТип(Тип("Булево")) Тогда
        
            МассивПолей.properties = СтруктураСтрокаТекстЧисло(Выборка.ЭлементарныйВопрос);
        
        ИначеЕсли Выборка.ЭлементарныйВопросТипЗначения.СодержитТип(Тип("Дата")) Тогда
        
            СтруктураПолей.properties = СтруктураДата(Выборка.ЭлементарныйВопрос);
            
        ИначеЕсли Выборка.ЭлементарныйВопросТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Файлы") Тогда
        
            СтруктураПолей.properties = СтруктураФайл(Выборка.ЭлементарныйВопрос);
        
        ИначеЕсли Выборка.ЭлементарныйВопросТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Страны") Тогда
        
            МассивJSON = СправочникКакМассив("Страны");
            СтруктураПолей.properties = СтруктураСВариантомВыбора(Выборка.ЭлементарныйВопрос,МассивJSON);             
        
        КонецЕсли;
    
    КонецЦикла;
    
    СтруктураФормыJSON = РаботаJSON.СтруктураКакJSON(СтруктураПолей);
    Реквизит1 = СтруктураФормыJSON;              
    
КонецПроцедуры

Функция СправочникКакМассив(НаименованиеСправочника) 
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   Страны.Наименование КАК JSON
        |ИЗ
        |   Справочник."+НаименованиеСправочника+" КАК Страны";
    
    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("JSON");      

КонецФункции

Функция СтруктураСтрокаТекстЧисло(ЭлементарныйВопрос)

        Возврат Новый Структура (ЭлементарныйВопрос.Транслит, 
        Новый Структура("type, title",СоответствиеТипов().Получить(ЭлементарныйВопрос.ТипыОтветовНаВопрос),ЭлементарныйВопрос.Наименование));	
    
КонецФункции // СтруктураСтроки()

Функция СтруктураДата(ЭлементарныйВопрос)

    Возврат Новый Структура(ЭлементарныйВопрос.Транслит, 
    Новый Структура("type,title,format", "string",ЭлементарныйВопрос.Заголовок,"date"));	
    
КонецФункции // СтруктураСтроки()

Функция СтруктураСВариантомВыбора(ЭлементарныйВопрос,МассивЗначенийСправочника)

    Если ЭлементарныйВопрос.ТипыОтветовНаВопрос = Перечисления.ТипыОтветовНаВопрос.ОдинИз ИЛИ ЭлементарныйВопрос.ТипыОтветовНаВопрос = Перечисления.ТипыОтветовНаВопрос.ЗначениеИнформационнойБазы Тогда    
        Тип = "string";
        Возврат Новый Структура (ЭлементарныйВопрос.Транслит, 
        Новый Структура("type,title,enum","string",ЭлементарныйВопрос.Наименование,МассивЗначенийСправочника)); 
    ИначеЕсли ЭлементарныйВопрос.ТипыОтветовНаВопрос = Перечисления.ТипыОтветовНаВопрос.НесколькоВариантовИз Тогда
        Тип = "array";    
        Возврат Новый Структура (ЭлементарныйВопрос.Транслит, 
        Новый Структура("type,title,items","array",ЭлементарныйВопрос.Наименование,МассивЗначенийСправочника)); 
    КонецЕсли;    
    
КонецФункции // СтруктураСтроки()
 
Функция СтруктураФайл(ЭлементарныйВопрос)
    
    Возврат Новый Структура(ЭлементарныйВопрос.Транслит, 
    Новый Структура("type,title,items","array",ЭлементарныйВопрос.Наименование,
        Новый Структура("properties", 
            Новый Структура("file", 
                Новый Структура("type,title,format", "string","Загрузите файл", "data-url"))))); 
    
КонецФункции // СтруктураСтроки()

Функция СтруктураТабличныйВопрос(Выборка)

    Возврат Новый Структура(Выборка.Транслит, 
    Новый Структура("type,title,items", "array",Выборка.Наименование,
        Новый Структура("properties", 
            Новый Структура("identified", 
                Новый Структура("title,properties", "",ПереборТабличныхВопросов(Выборка.Ссылка))))));
            
КонецФункции // СтруктураСтроки()

Функция ПереборТабличныхВопросов(ЭлементарныйВопрос)

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    ВопросыШаблонаАнкетСоставТабличногоВопроса.ЭлементарныйВопрос КАК ЭлементарныйВопрос
                   |ИЗ
                   |    Справочник.ВопросыШаблонаАнкет.СоставТабличногоВопроса КАК ВопросыШаблонаАнкетСоставТабличногоВопроса
                   |ГДЕ
                   |    ВопросыШаблонаАнкетСоставТабличногоВопроса.Ссылка = &Ссылка";
    Запрос.УстановитьПараметр("Ссылка", ЭлементарныйВопрос);
    СоставТабличногоВопрса = Запрос.Выполнить().Выбрать();
    
    СтруктураДляВозврата = Новый Структура();
    
    Пока СоставТабличногоВопрса.Следующий() Цикл
        СтруктураВопроса = Новый Структура("type, title",СоответствиеТипов().Получить(СоставТабличногоВопрса.ЭлементарныйВопрос.ТипыОтветовНаВопрос),СоставТабличногоВопрса.ЭлементарныйВопрос.Наименование);
        СтруктураДляВозврата.Вставить(СоставТабличногоВопрса.ЭлементарныйВопрос.Транслит,СтруктураВопроса);
    КонецЦикла;
    
    Возврат СтруктураДляВозврата;

КонецФункции // ПереборТабличныхВопросов()

Функция СоответствиеТипов()

    Строка = Перечисления.ТипыОтветовНаВопрос.Строка;
    Текст = Перечисления.ТипыОтветовНаВопрос.Текст;
    Число = Перечисления.ТипыОтветовНаВопрос.Число;
    Дата = Перечисления.ТипыОтветовНаВопрос.Дата;
    Булево = Перечисления.ТипыОтветовНаВопрос.Булево;
    ЗначениеИнформационнойБазы = Перечисления.ТипыОтветовНаВопрос.ЗначениеИнформационнойБазы;
    ОдинИз = Перечисления.ТипыОтветовНаВопрос.ОдинИз;
    НесколькоВариантовИз = Перечисления.ТипыОтветовНаВопрос.НесколькоВариантовИз;
    Файл = Перечисления.ТипыОтветовНаВопрос.Файл;

    Соотвествие = Новый Соответствие;
    Соотвествие.Вставить(Строка,"string");
    Соотвествие.Вставить(Текст,"text");
    Соотвествие.Вставить(Число,"number");
    Соотвествие.Вставить(Дата,"date");
    Соотвествие.Вставить(Булево,"boolean");
    Соотвествие.Вставить(ЗначениеИнформационнойБазы,"link");
    Соотвествие.Вставить(ОдинИз,"enum");
    Соотвествие.Вставить(НесколькоВариантовИз,"items");
    Соотвествие.Вставить(Файл,"file");
    
    Возврат Соотвествие;
    
КонецФункции // ПереопределениеТиповОтветаНаВопросы()


&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Анкета = Справочники.ШаблоныАнкет.НайтиПоКоду("000000001");
КонецПроцедуры
